renesas/rx-driver-package/source/r_mmcif_rx/r_mmcif_rx_vx.xx/r_mmcif_rx/src/targets/rx71m/r_mmcif_dev.c
/**********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No 
* other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all 
* applicable laws, including copyright laws. 
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY, 
* FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM 
* EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES 
* SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
* SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of 
* this software. By using this software, you agree to the additional terms and conditions found by accessing the 
* following link:
* http://www.renesas.com/disclaimer 
*
* Copyright (C) 2014(2015-2019) Renesas Electronics Corporation. All rights reserved.    
**********************************************************************************************************************/
/**********************************************************************************************************************
* System Name  : MMC Driver
* File Name    : r_mmcif_dev_port.c
* Version      : 1.07
* Device       : RX71M (LQFP-176)
* Abstract     : API & Sub module
* Tool-Chain   : For RX71M Group
*              :  e2 studio (Version 7.4.0)
* OS           : not use
* H/W Platform : RSK board for RX71M
* Description  : Interface file for MMC API for RX
* Limitation   : None
**********************************************************************************************************************/
/**********************************************************************************************************************
* History      : DD.MM.YYYY Version Description
*              : 03.09.2014 1.00    First Release
*              : 28.12.2016 1.01    Added r_mmcif_dev_hardware_lock() and r_mmcif_dev_hardware_unlock().
*              : 20.05.2019 1.05    Added support for GNUC and ICCRX.
*                                   Fixed coding style.
*              : 30.07.2019 1.06    Added WAIT LOOP .
*              : 22.11.2019 1.07    Added support for atomic control.
*                                   Modified comment of API function to Doxygen style.
**********************************************************************************************************************/

/**********************************************************************************************************************
Includes <System Includes> , "Project Includes"
**********************************************************************************************************************/
#include "platform.h"
#if defined(BSP_MCU_RX71M)

#include "r_mmcif_rx_if.h"
#include "./src/r_mmcif_rx_private.h"
#include "./src/targets/rx71m/r_mmcif_rx_target.h"


/**********************************************************************************************************************
Macro definitions
**********************************************************************************************************************/
#define MMC_TIMER_MAX_CH        (8)
#define MMC_TIMER_CH_FLG        (0)
#define MMC_TIMER_CH_COUNT      (1)
#define MMC_TIMER_CH_MAX_COUNT  (2)


/**********************************************************************************************************************
Typedef definitions
**********************************************************************************************************************/

/**********************************************************************************************************************
Private global variables and functions
**********************************************************************************************************************/
static volatile uint32_t gs_mmc_int_dmacdtcflg[(sizeof(MMC_CFG_IP_BASE) / sizeof(uint32_t))];
static volatile uint32_t gs_mmc_timer_cnt_out[MMC_TIMER_MAX_CH][MMC_TIMER_CH_MAX_COUNT + 1];

static mmc_status_t r_mmcif_dev_start_timer(uint32_t channel, uint32_t msec);
static mmc_status_t r_mmcif_dev_check_timer(uint32_t channel);
static void         r_mmcif_dev_end_timer(uint32_t channel);


/* MMC_MBFAI */
R_BSP_PRAGMA_STATIC_INTERRUPT(r_mmcif_mbfai_isr, VECT(MMCIF, MBFAI))
R_BSP_ATTRIB_STATIC_INTERRUPT void r_mmcif_mbfai_isr(void)
{
    R_MMCIF_Set_DmacDtc_Trans_Flg(MMC_CH0, MMC_SET_TRANS_STOP);
}


/**********************************************************************************************************************
* Outline      : Initialize MMC
* Function Name: r_mmcif_dev_init
* Description  : Initializes hardware to access MMC.
* Arguments    : uint32_t           channel         ;   MMC Channel No.
* Return Value : MMC_SUCCESS                        ;   Successful operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
mmc_status_t r_mmcif_dev_init(uint32_t channel)
{
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    bsp_int_ctrl_t int_ctrl;
#endif  /* ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6) */

#ifdef MMC_CFG_USE_FIT
    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);  /* Enable writing to MSTP registers. */
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
#endif  /* ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6) */
    MSTP_MMCIF = 0;               /* MMC ON */
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
#endif  /* ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6) */
    if (0 == MSTP_MMCIF)
    {
        R_BSP_NOP();  /* Wait for the write completion. */
    }
    R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);   /* Disable writing to MSTP registers. */
#else
    SYSTEM.PRCR.WORD = 0xA502;
    if (0 == SYSTEM.PRCR.WORD)
    {
        R_BSP_NOP();  /* Wait for the write completion. */
    }
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
#endif  /* ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6) */
    MSTP_MMCIF = 0;               /* MMC ON */
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
#endif  /* ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6) */
    if (0 == MSTP_MMCIF)
    {
        R_BSP_NOP();  /* Wait for the write completion. */
    }
    SYSTEM.PRCR.WORD = 0xA500;
    if (0 == SYSTEM.PRCR.WORD)
    {
        R_BSP_NOP();  /* Wait for the write completion. */
    }
    
#endif  /* MMC_CFG_USE_FIT */

